entities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-04 ma. 14:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Hans Elias" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline58">1. Abstractions</a>
<ul>
<li><a href="#orgheadline2">1.1. Entity component system?</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Seems like a bad fit for a functional language in its raw form</a></li>
</ul>
</li>
<li><a href="#orgheadline57">1.2. Property pattern?</a>
<ul>
<li><a href="#orgheadline12">1.2.1. Base properties / Dynamic properties</a></li>
<li><a href="#orgheadline16">1.2.2. Property transitions?</a></li>
<li><a href="#orgheadline20">1.2.3. Behaviors</a></li>
<li><a href="#orgheadline29">1.2.4. Thoughts</a></li>
<li><a href="#orgheadline41">1.2.5. Example events</a></li>
<li><a href="#orgheadline56">1.2.6. Implementation</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline58" class="outline-2">
<h2 id="orgheadline58"><span class="section-number-2">1</span> Abstractions</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.1</span> Entity component system?</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Seems like a bad fit for a functional language in its raw form</h4>
</div>
</div>
<div id="outline-container-orgheadline57" class="outline-3">
<h3 id="orgheadline57"><span class="section-number-3">1.2</span> Property pattern?</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">1.2.1</span> Base properties / Dynamic properties</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="orgheadline3"></a>Base properties are set from the beginning, per entity type<br  /></li>
<li><a id="orgheadline5"></a>Dynamic properties are things like health/position/name/id<br  /><ol class="org-ol"><li><a id="orgheadline4"></a>These are the ones that get saved<br  /></li></ol></li>
<li><a id="orgheadline11"></a>Same interface?<br  /><ol class="org-ol"><li><a id="orgheadline10"></a>Offer the ability to override base properties?<br  /><ol class="org-ol"><li><a id="orgheadline6"></a>Too powerful?<br  /></li>
<li><a id="orgheadline7"></a>Very customizable<br  /></li>
<li><a id="orgheadline9"></a>Final (non overridable) base properties?<br  /><ol class="org-ol"><li><a id="orgheadline8"></a>For things like entity type, should not change to prevent bad behavior<br  /></li></ol></li></ol></li></ol></li></ol>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">1.2.2</span> Property transitions?</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="orgheadline13"></a>Need to handle changes in properties, send data to client/listeners<br  /></li>
<li><a id="orgheadline15"></a>We may need to handle transitions in multiple attributes at the same time<br  /><ol class="org-ol"><li><a id="orgheadline14"></a>Transaction?<br  /></li></ol></li></ol>
</div>
<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">1.2.3</span> Behaviors</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="orgheadline17"></a>How do we act on events? (say input data from player)<br  /></li>
<li><a id="orgheadline19"></a>How do we act on property changes?<br  /><ol class="org-ol"><li><a id="orgheadline18"></a>Derived properties?<br  /></li></ol></li></ol>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">1.2.4</span> Thoughts</h4>
<div class="outline-text-4" id="text-1-2-4">
</div><ol class="org-ol"><li><a id="orgheadline24"></a>Way to query things like position of all entities without iterating them all?<br  /><ol class="org-ol"><li><a id="orgheadline23"></a>Server listening to event bus, updating state?<br  /><ol class="org-ol"><li><a id="orgheadline21"></a>Could update central read-optimized ETS table?<br  /></li>
<li><a id="orgheadline22"></a>Easily queries by the entity processes themselves<br  /></li></ol></li></ol></li>
<li><a id="orgheadline27"></a>Avoiding infinite loops<br  /><ol class="org-ol"><li><a id="orgheadline25"></a>Should be easily runtime testable in most cases?<br  /></li>
<li><a id="orgheadline26"></a>Would like to avoid imposing constrains because of this<br  /></li></ol></li>
<li><a id="orgheadline28"></a>This is starting to look like a kind of reactive programming?<br  /></li></ol>
</div>
<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">1.2.5</span> Example events</h4>
<div class="outline-text-4" id="text-1-2-5">
</div><ol class="org-ol"><li><a id="orgheadline32"></a>We get a move event from player client<br  /><ol class="org-ol"><li><a id="orgheadline30"></a>An event behavior gets triggered, updates the position<br  /></li>
<li><a id="orgheadline31"></a>Property behavior gets triggered by property update, send position event to event hub<br  /></li></ol></li>
<li><a id="orgheadline34"></a>We get a move event from event hub (player entity)<br  /><ol class="org-ol"><li><a id="orgheadline33"></a>Event behavior gets triggered,<br  /></li></ol></li>
<li><a id="orgheadline37"></a>An NPC moves once per tick<br  /><ol class="org-ol"><li><a id="orgheadline35"></a>Tick event behavior gets triggered, runs per-tick AI code, sets position property<br  /></li>
<li><a id="orgheadline36"></a>Property behavior gets triggered, send position to event hub<br  /></li></ol></li>
<li><a id="orgheadline39"></a>A player punches another player<br  /><div class="outline-text-5" id="text-1-2-5-4">
<p>
This is an action that does not persist state in the same way as, say movement.
(Is there any reason to handle it in a different way than things that do?)
(Are there any actions like this we don't want to trigger a cooldown? Possibly from the server?)
It would make sense to trigger a cooldown timer on actions like this, this also helps with anticheat.
Cooldowns like this might be a very common action, do we want to take them into account in the implementation?
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline38"></a>An events gets triggered, updates the punch state? (timer?),<br  /></li></ol></li>
<li><a id="orgheadline40"></a>A player walks off a block, he falls<br  /></li></ol>
</div>
<div id="outline-container-orgheadline56" class="outline-4">
<h4 id="orgheadline56"><span class="section-number-4">1.2.6</span> Implementation</h4>
<div class="outline-text-4" id="text-1-2-6">
</div><ol class="org-ol"><li><a id="orgheadline43"></a>Entity type represented by module<br  /><ol class="org-ol"><li><a id="orgheadline42"></a>Enables us to do more stuff at compile time in the future if important for performance<br  /></li></ol></li>
<li><a id="orgheadline46"></a>Declare properties with an accumulated module attributes?<br  /><ol class="org-ol"><li><a id="orgheadline44"></a>Something like '@property :name'<br  /></li>
<li><a id="orgheadline45"></a>Convenient way to organize code, like a headline<br  /></li></ol></li>
<li><a id="orgheadline55"></a>Code reusability provided by "behavior" modules with <span class="underline"><span class="underline">using</span></span> macro<br  /><ol class="org-ol"><li><a id="orgheadline47"></a>Macro would defdelegate to the module itself<br  /></li>
<li><a id="orgheadline51"></a>A lot of common functionality could (probably) be implemented this way<br  /><ol class="org-ol"><li><a id="orgheadline48"></a>Health<br  /></li>
<li><a id="orgheadline49"></a>Movement<br  /></li>
<li><a id="orgheadline50"></a>Physics<br  /></li></ol></li>
<li><a id="orgheadline53"></a>Ability to depend on other behaviors/properties?<br  /><ol class="org-ol"><li><a id="orgheadline52"></a>Not needed for now, can look into if manual ever becomes an issue<br  /></li></ol></li>
<li><a id="orgheadline54"></a>Customized by properties(ideal? could be more dynamic. possibly only for things like max health?) or callbacks(maybe for more logicy things)<br  /></li></ol></li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hans Elias</p>
<p class="date">Created: 2016-04-04 ma. 14:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
